{
  "model_type": "bert",
  "architectures": ["BertForMaskedLM"],
  "vocab_size": 32000,
  "hidden_size": 384,
  "num_hidden_layers": 6,
  "num_attention_heads": 6,
  "intermediate_size": 1536,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 512,
  "type_vocab_size": 2,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "pad_token_id": 0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "position_embedding_type": "absolute",
  "mlm_probability": 0.15
}